tutorials/lagrangian/reactingParcelFoam/verticalChannel/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   rho;
}

chemistry       off;

initialChemicalTimeStep 1e-07;

sequentialCoeffs
{
    cTauChem        0.001;
    equilibriumRateLimiter off;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          RK;
    eps             0.05;
    scale           1;
}


// ************************************************************************* //
